{
  "coding_language": {
    "description": "TBD",
    "type": "string",
    "oneOf": [
      {
        "const": "gene expression",
        "description": "Data is about studying how genes are manifested or suppressed."
      },
      {
        "const": "proteomics",
        "description": "Data is about the large-scale study of proteins."
      },
      {
        "const": "phenotyping",
        "description": "Data is about studying the observable characteristics of participants. This may or may not be paired with genotyping, as well."
      },
      {
        "const": "metagenomics",
        "description": "Data is about the study and analysis of the collective genetic material and resultant files from the participant, microorganisms, and their environment."
      },
      {
        "const": "patient list",
        "description": "Data is a list of participant MRNs."
      },
      {
        "const": "clinical notes",
        "description": "Data is about notes, often free text, produced from visits to a healthcare provider. N.B. Data or files produced directly from collection information about the physical state of the participant should take the term \"participant\"."
      },
      {
        "const": "clinical encounters",
        "description": "Data is about a defined set of information produced from visits to a healthcare provider. N.B. Data or files produced directly from collection information about the physical state of the participant should take the term \"participant\"."
      },
      {
        "const": "datasets",
        "description": "Describes how whole, discrete datasets comprising the series or collection are created, edited, and maintained."
      },
      {
        "const": "files",
        "description": "Describes how files comprising the dataset are created, edited, and maintained."
      },
      {
        "const": "clinical registry",
        "description": "Data is about a defined set of participants and defined set of information related to those participants."
      },
      {
        "const": "set up and installation",
        "description": "Data is about how the study, experiment, or analysis is designed and initially run."
      },
      {
        "const": "workflow",
        "description": "Data is about how the study, experiment, or analysis is conducted."
      },
      {
        "const": "administration",
        "description": "Data is about the archival governance of the study and its datasets."
      },
      {
        "const": "participant",
        "description": "Data is about and collected directly from living body of participant."
      },
      {
        "const": "fluoroscopic tracings",
        "description": "Videourodynamics (VUDS) fluoroscopic tracings."
      },
      {
        "const": "genomics",
        "description": "The study of all a person or organism's genes and their functions."
      },
      {
        "const": "survey data",
        "description": "Data collected from surveys."
      },
      {
        "const": "TBD",
        "description": "Placeholder value."
      }
    ]
  },
  "coding_level": {
    "description": "TBD",
    "type": "string",
    "oneOf": [
      {
        "const": "getting started",
        "description": "These modules are primarily about getting a platform set up."
      },
      {
        "const": "TBD",
        "description": "Placeholder value."
      }
    ]
  }
}